# PulldownButtonData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PulldownButtonData Class
Members See Also
---
This class contains information necessary to construct a pulldown button in the Ribbon.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class PulldownButtonData : ButtonData
```

Visual Basic
---
```text
Public Class PulldownButtonData _
	Inherits ButtonData
```

Visual C++
---
```text
public ref class PulldownButtonData : public ButtonData
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI..::..RibbonItemData Autodesk.Revit.UI..::..ButtonData Autodesk.Revit.UI..::..PulldownButtonData Autodesk.Revit.UI..::..SplitButtonData
# See Also
PulldownButtonData Members
Autodesk.Revit.UI Namespace